

var trainSchedule = {
  //新自強3xx

  //普悠瑪2xx
  '201': {
      '車種': '普悠瑪',
      '車站時間': [
          ['南港', '07:42'],['松山', '07:48'],['臺北', '08:00'],['萬華', '08:05'],['板橋', '08:10'],
          ['桃園', '08:26'],['臺中', '09:40'],['嘉義', '10:36'],['臺南', '11:12'],['高雄', '11:42'],
          ['屏東', '11:57'],['潮州', '12:12'],['枋寮', '12:33']
      ]
  },
  '203': {
    '車種': '普悠瑪',
    '車站時間': [
        ['南港', '12:45'],['松山', '12:49'],['臺北', '13:00'],['萬華', '13:05'],['板橋', '13:10'],
        ['臺中', '14:48'],['嘉義', '15:49'],['臺南', '16:27'],['高雄', '17:00'],
        ['屏東', '17:20'],['潮州', '17:35']
    ]
  },
  '205': {
    '車種': '普悠瑪',
    '車站時間': [
        ['南港', '18:25'],['松山', '18:30'],['臺北', '18:40'],['萬華', '18:45'],['板橋', '18:51'],
        ['新竹', '19:32'],['臺中', '20:28'],['嘉義', '21:10'],['臺南', '21:43'],['高雄', '22:11'],
        ['屏東', '22:26'],['潮州', '22:30']
    ]
  },
  '221': {
    '車種': '普悠瑪',
    '車站時間': [
        ['花蓮', '05:25'],['羅東', '06:30'],['宜蘭', '06:40'],['七堵', '07:30'],
        ['松山', '07:45'],['臺北', '07:51'],['萬華', '07:56'],['板橋', '08:02'],['樹林', '08:10']
    ]
  },
  '223': {
    '車種': '普悠瑪',
    '車站時間': [
        ['花蓮', '06:25'],['新城', '06:42'],['羅東', '07:30'],['宜蘭', '07:40'],
        ['礁溪', '07:47'],['頭城', '07:52'],['八堵', '08:35'],
        ['松山', '08:45'],['臺北', '08:51'],['萬華', '08:56'],['板橋', '09:02'],['樹林', '09:10']
    ]
  },
  '225': {
    '車種': '普悠瑪',
    '車站時間': [
        ['花蓮', '10:25'],['羅東', '11:30'],['宜蘭', '11:40'],['七堵', '12:30'],
        ['松山', '12:45'],['臺北', '12:51'],['萬華', '12:56'],['板橋', '13:02'],
        ['桃園', '13:21'],['新竹', '13:45'],
        ['豐原', '14:20'],['臺中', '14:31'],['彰化', '14:42']
    ]
  },
  '227': {
    '車種': '普悠瑪',
    '車站時間': [
        ['花蓮', '11:25'],['新城', '11:42'],['羅東', '12:30'],['宜蘭', '12:40'],
        ['松山', '13:45'],['臺北', '13:51'],['萬華', '13:56'],['板橋', '14:02'],['樹林', '14:10']
    ]
  },
  '229': {
    '車種': '普悠瑪',
    '車站時間': [
        ['花蓮', '13:25'],['羅東', '14:30'],['宜蘭', '14:40'],['七堵', '15:30'],
        ['松山', '15:45'],['臺北', '15:51'],['萬華', '15:56'],['板橋', '16:02'],
        ['豐原', '17:26'],['臺中', '17:38'],['彰化', '17:50']
    ]
  },
  '231': {
    '車種': '普悠瑪',
    '車站時間': [
        ['花蓮', '16:25'],['新城', '16:42'],['羅東', '17:30'],['宜蘭', '17:40'],
        ['松山', '18:45'],['臺北', '18:51'],['萬華', '18:56'],['板橋', '19:02'],['樹林', '19:10']
    ]
  },
  '233': {
    '車種': '普悠瑪',
    '車站時間': [
        ['花蓮', '19:25'],['羅東', '20:30'],['宜蘭', '20:40'],['七堵', '21:30'],
        ['松山', '21:45'],['臺北', '21:51'],['萬華', '21:56'],['板橋', '22:02'],
        ['桃園', '22:21'],['新竹', '22:45'],
        ['豐原', '23:20'],['臺中', '23:31'],['彰化', '23:42']
    ]
  },
  '235': {
    '車種': '普悠瑪',
    '車站時間': [
        ['花蓮', '20:25'],['新城', '20:40'],['羅東', '21:30'],['宜蘭', '21:40'],
        ['礁溪', '21:47'],['頭城', '21:52'],['八堵', '22:30'],
        ['松山', '22:45'],['臺北', '22:51'],['萬華', '22:56'],['板橋', '23:02'],['樹林', '23:26']
    ]
  },
  '255': {
    '車種': '普悠瑪',
    '車站時間': [
        ['臺東', '05:25'],['鹿野', '05:35'],['關山', '05:46'],['池上', '05:56'],['玉里', '06:16'],
        ['瑞穗', '06:33'],['光復', '06:45'],['鳳林', '06:55'],['壽豐', '07:05'],['花蓮', '07:20'],
        ['羅東', '08:12'],['宜蘭', '08:20'],
        ['南港', '09:22'],['松山', '09:27'],['臺北', '09:37'],['萬華', '09:42'],['板橋', '09:48'],['樹林', '09:56']
    ]
  },
  '257': {
    '車種': '普悠瑪',
    '車站時間': [
        ['臺東', '07:00'],['玉里', '07:40'],['花蓮', '08:30'],
        ['南港', '10:20'],['松山', '10:25'],['臺北', '10:35'],['萬華', '10:40'],['板橋', '10:46'],['樹林', '10:13']
    ]
  },
  '259': {
    '車種': '普悠瑪',
    '車站時間': [
        ['臺東', '10:25'],['關山', '10:46'],['池上', '10:56'],['玉里', '11:16'],
        ['瑞穗', '11:33'],['光復', '11:45'],['花蓮', '12:20'],
        ['宜蘭', '13:20'],
        ['南港', '14:22'],['松山', '14:27'],['臺北', '14:37'],['萬華', '14:42'],['板橋', '14:48'],['樹林', '14:56']
    ]
  },
  '261': {
    '車種': '普悠瑪',
    '車站時間': [
        ['臺東', '13:00'],['玉里', '13:40'],['花蓮', '14:30'],
        ['南港', '16:20'],['松山', '16:25'],['臺北', '16:35'],['萬華', '16:40'],['板橋', '16:46'],['樹林', '16:13']
    ]
  },
  '263': {
    '車種': '普悠瑪',
    '車站時間': [
        ['臺東', '15:25'],['鹿野', '15:35'],['關山', '15:46'],['池上', '15:56'],['玉里', '16:16'],
        ['瑞穗', '16:33'],['光復', '16:45'],['鳳林', '16:55'],['壽豐', '17:05'],['花蓮', '17:20'],
        ['羅東', '18:12'],['宜蘭', '18:20'],
        ['南港', '19:22'],['松山', '19:27'],['臺北', '19:37'],['萬華', '19:42'],['板橋', '19:48'],['樹林', '19:56']
    ]
  },
  '265': {
    '車種': '普悠瑪',
    '車站時間': [
        ['臺東', '17:00'],['玉里', '17:40'],['花蓮', '18:30'],
        ['南港', '20:20'],['松山', '20:25'],['臺北', '20:35'],['萬華', '20:40'],['板橋', '20:46'],['樹林', '20:13']
    ]
  },
  '267': {
    '車種': '普悠瑪',
    '車站時間': [
        ['臺東', '19:25'],['鹿野', '19:35'],['關山', '19:46'],['池上', '19:56'],['玉里', '20:16'],
        ['瑞穗', '20:33'],['光復', '20:45'],['鳳林', '20:55'],['壽豐', '21:05'],['花蓮', '21:20'],
        ['羅東', '22:12'],['宜蘭', '22:20'],
        ['南港', '23:22'],['松山', '23:27'],['臺北', '23:37'],['萬華', '23:42'],['板橋', '23:48'],['樹林', '23:56']
    ]
  },
 

  //自強號1xx
  '101': {
    '車種': '自強號',
    '車站時間': [
        ['瑞芳', '05:45'],['七堵', '06:00'],['汐止', '06:10'],['松山', '06:20'],['臺北', '06:30'],
        ['萬華', '06:36'],['板橋', '06:42'],
        ['桃園', '07:02'],['中壢', '07:12'],['新竹', '07:43'],
        ['竹南', '07:56'],['苗栗', '07:08'],['豐原', '07:35'],
        ['臺中', '07:47'],['彰化', '08:04'],
        ['員林', '08:15'],['斗六', '08:46'],        
        ['嘉義', '09:11'],['新營', '09:27'],['臺南', '09:54'],
        ['新左營', '10:24'],['高雄', '10:36'],['鳳山', '10:44'],['屏東', '10:59'],['潮州', '11:12']
    ]
},
'103': {
  '車種': '自強號',
  '車站時間': [
      ['臺中', '05:47'],['新烏日', '05:55'],['彰化', '06:04'],
      ['員林', '06:15'],['田中', '06:24'],['斗六', '06:46'],['斗南', '06:54'],        
      ['嘉義', '07:02'],['新營', '07:18'],['善化', '07:33'],['永康', '07:43'],['臺南', '07:53'],
      ['新左營', '08:20'],['高雄', '08:32'],['鳳山', '08:44'],['屏東', '08:55'],['潮州', '09:10'],
      ['南州', '09:20'],['林邊', '09:28'],['枋寮', '09:38']
  ]
},
'105': {
  '車種': '自強號',
  '車站時間': [
      ['基隆', '06:45'],['八堵', '06:53'],['七堵', '07:00'],['汐止', '07:10'],['松山', '07:20'],['臺北', '07:30'],
      ['萬華', '07:36'],['板橋', '07:42'],['樹林', '07:52'],
      ['桃園', '08:07'],['中壢', '08:18'],['湖口', '08:30'],['竹北', '08:45'],['新竹', '08:51'],
      ['竹南', '09:06'],['苗栗', '09:18'],['后里', '09:36'],['豐原', '09:45'],
      ['臺中', '09:58'],['彰化', '10:14'],
      ['員林', '10:25'],['田中', '10:34'],['斗六', '10:56'],['斗南', '11:04'],        
      ['嘉義', '11:11'],['新營', '11:27'],['善化', '11:47'],['臺南', '12:00'],
      ['新左營', '12:27'],['高雄', '12:38'],['鳳山', '12:50'],['屏東', '13:00'],['潮州', '13:15'],
      ['南州', '13:25'],['林邊', '13:33'],['枋寮', '13:43']
  ]
},
'107': {
  '車種': '自強號',
  '車站時間': [
      ['七堵', '08:00'],['汐止', '08:10'],['松山', '08:20'],['臺北', '08:30'],
      ['萬華', '08:36'],['板橋', '08:42'],
      ['桃園', '09:02'],['中壢', '09:12'],['新竹', '09:43'],
      ['竹南', '09:56'],['苗栗', '10:08'],['豐原', '10:35'],
      ['臺中', '10:47'],['彰化', '11:04'],
      ['員林', '11:15'],['斗六', '11:46'],        
      ['嘉義', '12:11'],['新營', '12:27'],['臺南', '12:54'],
      ['新左營', '13:24'],['高雄', '13:36'],['鳳山', '13:44'],['屏東', '13:59'],['潮州', '14:12']
  ]
},
'109' : {
  '車種': '自強號',
  '車站時間': [
      ['七堵', '09:00'],['汐止', '09:10'],['松山', '09:20'],['臺北', '09:30'],
      ['萬華', '09:36'],['板橋', '09:42'],
      ['桃園', '10:02'],['中壢', '10:12'],['新竹', '10:43'],
      ['竹南', '10:56'],['苗栗', '11:08'],['豐原', '11:35'],
      ['臺中', '11:47'],['彰化', '12:04'],
      ['員林', '12:15'],['斗六', '12:46'],['斗南', '12:04'],        
      ['嘉義', '13:11'],['新營', '13:27'],['臺南', '13:54'],
      ['新左營', '14:24'],['高雄', '14:36'],['鳳山', '14:44'],['屏東', '14:59'],['潮州', '15:12']
  ]
},
'111': {
  '車種': '自強號',
  '車站時間': [
    ['七堵', '10:00'],['汐止', '10:10'],['松山', '10:20'],['臺北', '10:30'],
    ['萬華', '10:36'],['板橋', '10:42'],
    ['桃園', '11:02'],['中壢', '11:12'],['新竹', '11:43'],
    ['竹南', '11:56'],['苗栗', '12:08'],['豐原', '12:35'],
    ['臺中', '12:47'],['彰化', '13:04'],
    ['員林', '13:15'],['斗六', '13:46'],        
    ['嘉義', '14:11'],['新營', '14:27'],['臺南', '14:54'],
    ['新左營', '15:24'],['高雄', '15:36'],['鳳山', '15:44'],['屏東', '15:59'],['潮州', '16:12']
  ]
},
'113': {
  '車種': '自強號',
  '車站時間': [
    ['七堵', '11:00'],['汐止', '11:10'],['松山', '11:20'],['臺北', '11:30'],
    ['萬華', '11:36'],['板橋', '11:42'],
    ['桃園', '12:02'],['中壢', '12:12'],['新竹', '12:43'],
    ['竹南', '12:56'],['苗栗', '13:08'],['豐原', '13:35'],
    ['臺中', '13:47'],['彰化', '14:04'],
    ['員林', '14:15'],['斗六', '14:46'],        
    ['嘉義', '15:11'],['新營', '15:27'],['臺南', '15:54'],
    ['新左營', '16:24'],['高雄', '16:36'],['鳳山', '16:44'],['屏東', '16:59'],['潮州', '17:12'],
    ['南州', '17:22'],['林邊', '17:30'],['枋寮', '17:40']
  ]
},
'115': {
  '車種': '自強號',
  '車站時間': [
      ['花蓮', '09:50'],['新城', '10:05'],['南澳', '10:30'],['蘇澳新', '10:54'],['羅東', '11:05'],
      ['宜蘭', '11:15'],['礁溪', '11:22'],['頭城', '11:30'],['福隆', '11:51'],['雙溪', '12:00'],
      ['瑞芳', '12:15'],
      ['七堵', '12:30'],['汐止', '12:40'],['松山', '12:50'],['臺北', '13:00'],
      ['萬華', '13:06'],['板橋', '13:12'],['樹林', '13:22'],
      ['桃園', '13:32'],['中壢', '13:42'],['新竹', '14:13'],
      ['竹南', '14:26'],['苗栗', '14:38'],['豐原', '15:05'],
      ['臺中', '15:17'],['彰化', '15:34'],
      ['員林', '15:45'],['斗六', '16:16'],['斗南', '16:34'],        
      ['嘉義', '16:41'],['新營', '16:57'],['臺南', '17:24'],
      ['新左營', '17:54'],['高雄', '18:06'],['鳳山', '18:14'],['屏東', '18:29'],['潮州', '18:42']
  ]
},
'117': {
  '車種': '自強號',
  '車站時間': [
    ['基隆', '13:15'],['八堵', '13:23'],['七堵', '13:30'],['汐止', '13:40'],['松山', '13:50'],['臺北', '14:00'],
    ['萬華', '14:06'],['板橋', '14:12'],
    ['桃園', '14:32'],['中壢', '14:42'],['新竹', '15:13'],
    ['竹南', '15:26'],['苗栗', '15:38'],['豐原', '16:05'],
    ['臺中', '16:17'],['彰化', '16:34'],
    ['員林', '16:45'],['斗六', '17:16'],        
    ['嘉義', '17:41'],['新營', '17:57'],['臺南', '18:24'],
    ['新左營', '18:54'],['高雄', '19:06'],['鳳山', '19:14'],['屏東', '19:29'],['潮州', '19:42']
  ]
},
'119': {
  '車種': '自強號',
  '車站時間': [
      ['七堵', '15:00'],['汐止', '15:10'],['松山', '15:20'],['臺北', '15:30'],
      ['萬華', '15:36'],['板橋', '15:42'],
      ['桃園', '16:07'],['中壢', '16:18'],['湖口', '16:30'],['竹北', '16:45'],['新竹', '16:51'],
      ['竹南', '17:06'],['苗栗', '17:18'],['后里', '17:36'],['豐原', '17:45'],
      ['臺中', '17:58'],['彰化', '18:14'],
      ['員林', '18:25'],['田中', '18:34'],['斗六', '18:56'],['斗南', '19:04'],        
      ['嘉義', '19:21'],['新營', '19:37'],['善化', '19:57'],['臺南', '20:10'],
      ['新左營', '20:37'],['高雄', '20:48'],['鳳山', '21:00'],['屏東', '21:10'],['潮州', '21:25']
  ]
},
'121': {
  '車種': '自強號',
  '車站時間': [
    ['七堵', '16:00'],['汐止', '16:10'],['松山', '16:20'],['臺北', '16:30'],
    ['萬華', '16:36'],['板橋', '16:42'],
    ['桃園', '17:02'],['中壢', '17:12'],['新竹', '17:43'],
    ['竹南', '17:56'],['苗栗', '18:08'],['豐原', '18:35'],
    ['臺中', '18:47'],['彰化', '19:04'],
    ['員林', '19:15'],['斗六', '19:46'],        
    ['嘉義', '20:11'],['新營', '20:27'],['臺南', '20:57'],
    ['新左營', '21:24'],['高雄', '21:36'],['鳳山', '21:54'],['屏東', '22:09'],['潮州', '22:24']
  ]
},
'123': {
  '車種': '自強號',
  '車站時間': [
    ['基隆', '16:45'],['八堵', '16:53'],['七堵', '17:00'],['汐止', '17:10'],['松山', '17:20'],['臺北', '17:30'],
    ['萬華', '17:36'],['板橋', '17:42'],
    ['桃園', '18:02'],['中壢', '18:12'],['新竹', '18:43'],
    ['竹南', '18:56'],['苗栗', '19:08'],['豐原', '19:35'],
    ['臺中', '19:47'],['彰化', '20:04'],
    ['員林', '20:15'],['斗六', '20:46'],        
    ['嘉義', '21:11'],['新營', '21:27'],['臺南', '21:57'],
    ['新左營', '22:24'],['高雄', '22:36'],['鳳山', '22:54'],['屏東', '23:09'],['潮州', '23:24']
  ]
},
'125': {
  '車種': '自強號',
  '車站時間': [
    ['花蓮', '15:20'],['新城', '15:35'],['南澳', '16:00'],['蘇澳新', '16:24'],['羅東', '16:35'],
    ['宜蘭', '16:45'],['礁溪', '16:52'],['頭城', '17:00'],['福隆', '17:21'],['雙溪', '17:30'],
    ['瑞芳', '17:45'],['七堵', '18:00'],['汐止', '18:10'],['松山', '18:20'],['臺北', '18:30'],
    ['萬華', '18:36'],['板橋', '18:42'],
    ['桃園', '19:02'],['中壢', '19:12'],['新竹', '19:43'],
    ['竹南', '19:56'],['苗栗', '20:08'],['豐原', '20:35'],
    ['臺中', '20:47'],['彰化', '21:04'],
    ['員林', '21:15'],['斗六', '21:46'],        
    ['嘉義', '22:11'],['新營', '22:27'],['臺南', '22:57'],
    ['新左營', '23:24'],['高雄', '23:36'],['鳳山', '23:54'],['屏東', '00:09'],['潮州', '00:24']
  ]
},
'127': {
  '車種': '自強號',
  '車站時間': [
    ['瑞芳', '19:00'],['七堵', '19:15'],['松山', '19:35'],['臺北', '19:45'],
    ['萬華', '19:51'],['板橋', '19:57'],
    ['桃園', '20:17'],['中壢', '20:27'],['新竹', '20:58'],
    ['竹南', '21:11'],['苗栗', '21:23'],['豐原', '21:50'],
    ['臺中', '22:02'],['彰化', '22:19'],
    ['員林', '22:30'],['斗六', '23:01'],       
    ['嘉義', '23:26'],['新營', '23:42'],['臺南', '23:12'],
    ['新左營', '23:39'],['高雄', '23:51'],['鳳山', '00:09'],['屏東', '00:24']
  ]
},
'129': {
  '車種': '自強號',
  '車站時間': [
    ['七堵', '20:45'], ['松山', '21:05'], ['臺北', '21:15'],
    ['萬華', '21:21'], ['板橋', '21:27'],
    ['桃園', '21:47'], ['中壢', '21:57'], ['新竹', '22:28'],
    ['竹南', '22:41'], ['苗栗', '22:53'], ['豐原', '23:20'],
    ['臺中', '23:32'], ['彰化', '23:49'],
    ['員林', '00:00'], ['斗六', '00:31']
  ]
},
'131': {
  '車種': '自強號',
  '車站時間': [
    ['七堵', '21:00'],['汐止', '21:10'],['松山', '21:20'],['臺北', '21:30'],
    ['萬華', '21:36'],['板橋', '21:42'],['樹林', '21:52'],
    ['桃園', '22:07'],['中壢', '22:18'],['湖口', '22:30'],['竹北', '22:45'],['新竹', '22:51'],
    ['竹南', '23:06'],['苗栗', '23:18'],['后里', '23:36'],['豐原', '23:45'],
    ['臺中', '23:58'],['彰化', '00:14']
  ]
},
'133': {
  '車種': '自強號',
  '車站時間': [
    ['花蓮', '21:00'],['新城', '21:15'],['南澳', '21:40'],['蘇澳新', '22:04'],['羅東', '22:15'],
    ['宜蘭', '22:25'],['礁溪', '22:32'],['頭城', '22:40'],['福隆', '23:01'],['雙溪', '23:10'],
    ['瑞芳', '23:25'],['八堵', '23:37'],['汐止', '23:50'],['松山', '00:00'],['臺北', '00:10'],
    ['萬華', '00:16'],['板橋', '00:22'],['樹林', '00:30']
  ]
},
'135': {
  '車種': '自強號',
  '車站時間': [
      ['彰化', '17:14'],['員林', '17:25'],['田中', '17:34'],['斗六', '17:56'],['斗南', '18:04'],        
      ['嘉義', '18:21'],['新營', '18:37'],['善化', '18:57'],['臺南', '19:10'],
      ['新左營', '19:37'],['高雄', '19:48'],['鳳山', '20:00'],['屏東', '20:10'],['潮州', '20:25'],
      ['南州', '20:35'],['林邊', '20:43'],['枋寮', '20:53']
    ]
},
'137': {
  '車種': '自強號',
  '車站時間': [
      ['彰化', '05:04'],['員林', '05:15'],['田中', '05:24'],['斗六', '05:46'],['斗南', '05:54'],        
      ['嘉義', '06:02'],['新營', '06:18'],['善化', '06:33'],['永康', '06:43'],['臺南', '06:53'],
      ['新左營', '07:20'],['高雄', '07:32'],['鳳山', '07:44'],['屏東', '07:55'],['潮州', '08:08'],
      ['南州', '08:18'],['林邊', '08:26'],['枋寮', '08:35']
  ]
},



  //莒光號4xx
  '401': {
    '車種': '莒光號',
    '車站時間': [
        ['臺東', '05:10'],['鹿野', '05:25'],['關山', '05:45'],['池上', '06:10'],['富里', '06:18'],['玉里', '06:38'],
        ['瑞穗', '07:01'],['光復', '07:26'],['萬榮', '07:34'],['鳳林', '07:36'],['壽豐', '07:53'],['吉安', '08:12'],
        ['花蓮', '08:20'],['新城', '08:42'],['南澳', '09:22'],['蘇澳新', '09:45'],['羅東', '09:58'],
        ['宜蘭', '10:08'],['礁溪', '10:16'],['頭城', '10:23'],['福隆', '10:43'],['雙溪', '10:55'],
        ['瑞芳', '11:05'],['七堵', '11:20'],['汐止', '11:30'],['松山', '11:40'],['臺北', '11:50'],
        ['萬華', '11:55'],['板橋', '12:02'],['樹林', '12:10'],['鶯歌', '12:22'],
        ['桃園', '12:36'],['中壢', '12:47'],['楊梅', '12:57'],['湖口', '13:10'],['竹北', '13:20'],['新竹', '13:30'],
        ['竹南', '13:48'],['苗栗', '14:03'],['后里', '14:22'],['豐原', '14:32'],
        ['臺中', '14:46'],['新烏日', '14:55'],['彰化', '15:14']
    ]
  },
  '403': {
    '車種': '莒光號',
    '車站時間': [
        ['花蓮', '14:20'],['新城', '14:42'],['南澳', '15:22'],['蘇澳新', '15:45'],['羅東', '15:58'],
        ['宜蘭', '16:08'],['礁溪', '16:16'],['頭城', '16:23'],['福隆', '16:43'],['雙溪', '16:55'],
        ['瑞芳', '17:05'],['七堵', '17:20'],['汐止', '17:30'],['松山', '17:40'],['臺北', '17:50'],
        ['萬華', '17:55'],['板橋', '18:02'],['樹林', '18:10'],['鶯歌', '18:22'],
        ['桃園', '18:36'],['中壢', '18:47'],['楊梅', '18:57'],['湖口', '19:10'],['竹北', '19:20'],['新竹', '19:30'],
        ['竹南', '19:48'],['苗栗', '20:03'],['后里', '20:22'],['豐原', '20:32'],
        ['臺中', '20:46'],['新烏日', '20:55'],['彰化', '21:14'],
        ['員林', '21:27'],['田中', '21:38'],['二水', '21:44'],['斗六', '21:59'],['斗南', '22:08'],['民雄', '22:17'],
        ['嘉義', '22:27'],['新營', '22:46'],['善化', '22:56'],['永康', '23:03'],
        ['臺南', '23:10'],['岡山', '23:33'],['新左營', '23:50']
    ]
  },

  //區間快2xxx

  //區間車1xxx
  '1901': {
    '車種': '區間車',
    '車站時間': [
        ['臺東', '05:02'],['鹿野', '05:19'],['關山', '05:36'],['池上', '05:51'],['富里', '05:59'],['玉里', '06:19'],
        ['瑞穗', '06:39'],['光復', '07:05'],['萬榮', '07:11'],['鳳林', '07:19'],['壽豐', '07:37'],['志學', '07:44'],
        ['吉安', '07:54'],['花蓮', '08:00']
    ]
},
  '1903': {
    '車種': '區間車',
    '車站時間': [
        ['臺東', '05:32'],['鹿野', '05:49'],['關山', '06:06'],['池上', '06:21'],['富里', '06:29'],['玉里', '06:49'],
        ['瑞穗', '07:09'],['光復', '07:35'],['萬榮', '07:41'],['鳳林', '07:49'],['壽豐', '08:07'],['志學', '08:14'],
        ['吉安', '08:24'],['花蓮', '08:30']
    ]
  },
  '1905': {
    '車種': '區間車',
    '車站時間': [
      ['臺東', '07:02'], ['鹿野', '07:19'], ['關山', '07:36'], ['池上', '07:51'], ['富里', '07:59'], ['玉里', '08:19'],
      ['瑞穗', '08:39'], ['光復', '09:05'], ['萬榮', '09:11'], ['鳳林', '09:19'], ['壽豐', '09:37'], ['志學', '09:44'],
      ['吉安', '09:54'], ['花蓮', '10:00']
    ]
},
'1907': {
  '車種': '區間車',
  '車站時間': [
    ['臺東', '09:32'], ['鹿野', '09:49'], ['關山', '10:06'], ['池上', '10:21'], ['富里', '10:29'], ['玉里', '10:49'],
    ['瑞穗', '11:09'], ['光復', '11:35'], ['萬榮', '11:41'], ['鳳林', '11:49'], ['壽豐', '12:07'], ['志學', '12:14'],
    ['吉安', '12:24'], ['花蓮', '12:30']
  ]
},
'1909': {
  '車種': '區間車',
  '車站時間': [
    ['臺東', '12:02'], ['鹿野', '12:19'], ['關山', '12:36'], ['池上', '12:51'], ['富里', '12:59'], ['玉里', '13:19'],
    ['瑞穗', '13:39'], ['光復', '14:05'], ['萬榮', '14:11'], ['鳳林', '14:19'], ['壽豐', '14:37'], ['志學', '14:44'],
    ['吉安', '14:54'], ['花蓮', '15:00']
  ]
},
'1911': {
  '車種': '區間車',
  '車站時間': [
    ['臺東', '14:32'], ['鹿野', '14:49'], ['關山', '15:06'], ['池上', '15:21'], ['富里', '15:29'], ['玉里', '15:49'],
    ['瑞穗', '16:09'], ['光復', '16:35'], ['萬榮', '16:41'], ['鳳林', '16:49'], ['壽豐', '17:07'], ['志學', '17:14'],
    ['吉安', '17:24'], ['花蓮', '17:30']
  ]
},
'1913': {
  '車種': '區間車',
  '車站時間': [
    ['臺東', '17:02'], ['鹿野', '17:19'], ['關山', '17:36'], ['池上', '17:51'], ['富里', '17:59'], ['玉里', '18:19'],
    ['瑞穗', '18:39'], ['光復', '19:05'], ['萬榮', '19:11'], ['鳳林', '19:19'], ['壽豐', '19:37'], ['志學', '19:44'],
    ['吉安', '19:54'], ['花蓮', '20:00']
  ]
},
'1915': {
  '車種': '區間車',
  '車站時間': [
    ['臺東', '19:32'], ['鹿野', '19:49'], ['關山', '20:06'], ['池上', '20:21'], ['富里', '20:29'], ['玉里', '20:49'],
    ['瑞穗', '21:09'], ['光復', '21:35'], ['萬榮', '21:41'], ['鳳林', '21:49'], ['壽豐', '22:07'], ['志學', '22:14'],
    ['吉安', '22:24'], ['花蓮', '22:30']
  ]
},
'1917': {
  '車種': '區間車',
  '車站時間': [
    ['臺東', '21:02'], ['鹿野', '21:19'], ['關山', '21:36'], ['池上', '21:51'], ['富里', '21:59'], ['玉里', '22:19'],
    ['瑞穗', '22:39'], ['光復', '23:05'], ['萬榮', '23:11'], ['鳳林', '23:19'], ['壽豐', '23:37'], ['志學', '23:44'],
    ['吉安', '23:54'], ['花蓮', '00:00']
  ]
},
'1919': {
  '車種': '區間車',
  '車站時間': [
    ['臺東', '22:02'], ['鹿野', '22:19'], ['關山', '22:36'], ['池上', '22:51'], ['富里', '22:59'], ['玉里', '23:19']
  ]
},
'1921': {
  '車種': '區間車',
  '車站時間': [
    ['花蓮', '05:00'],['新城', '05:18'], ['和平', '05:32'], ['南澳', '05:52'], ['東澳', '05:58'],['蘇澳新', '06:10']  
  ]
},
'1951': {
  '車種': '區間車',
  '車站時間': [
    ['玉里', '05:19'],
    ['瑞穗', '05:39'], ['光復', '06:05'], ['萬榮', '06:11'], ['鳳林', '06:19'], ['壽豐', '06:37'], ['志學', '06:44'],
    ['吉安', '06:54'], ['花蓮', '07:00'],['新城', '07:18'], ['和平', '07:32'], ['南澳', '07:52'], ['東澳', '07:58'], 
    ['蘇澳新', '08:10']  
  ]
},
'1953': {
  '車種': '區間車',
  '車站時間': [
    ['玉里', '07:19'],
    ['瑞穗', '07:39'], ['光復', '08:05'], ['萬榮', '08:11'], ['鳳林', '08:19'], ['壽豐', '08:37'], ['志學', '08:44'],
    ['吉安', '08:54'], ['花蓮', '09:00'], ['新城', '09:18'], ['和平', '09:32'], ['南澳', '09:52'], ['東澳', '09:58'], 
    ['蘇澳新', '10:10']  
  ]
},
'1955': {
  '車種': '區間車',
  '車站時間': [
    ['玉里', '09:19'],
    ['瑞穗', '09:39'], ['光復', '10:05'], ['萬榮', '10:11'], ['鳳林', '10:19'], ['壽豐', '10:37'], ['志學', '10:44'],
    ['吉安', '10:54'], ['花蓮', '11:00'], ['新城', '11:18'], ['和平', '11:32'], ['南澳', '11:52'], ['東澳', '11:58'], 
    ['蘇澳新', '12:10']  
  ]
},
'1957': {
  '車種': '區間車',
  '車站時間': [
    ['玉里', '11:19'],
    ['瑞穗', '11:39'], ['光復', '12:05'], ['萬榮', '12:11'], ['鳳林', '12:19'], ['壽豐', '12:37'], ['志學', '12:44'],
    ['吉安', '12:54'], ['花蓮', '13:00'], ['新城', '13:18'], ['和平', '13:32'], ['南澳', '13:52'], ['東澳', '13:58'], 
    ['蘇澳新', '14:10']  
  ]
},
'1959': {
  '車種': '區間車',
  '車站時間': [
    ['玉里', '12:19'],
    ['瑞穗', '12:39'], ['光復', '13:05'], ['萬榮', '13:11'], ['鳳林', '13:19'], ['壽豐', '13:37'], ['志學', '13:44'],
    ['吉安', '13:54'], ['花蓮', '14:00'], ['新城', '14:18'], ['和平', '14:32'], ['南澳', '14:52'], ['東澳', '14:58'], 
    ['蘇澳新', '15:10']  
  ]
},
'1961': {
  '車種': '區間車',
  '車站時間': [
    ['玉里', '14:19'],
    ['瑞穗', '14:39'], ['光復', '15:05'], ['萬榮', '15:11'], ['鳳林', '15:19'], ['壽豐', '15:37'], ['志學', '15:44'],
    ['吉安', '15:54'], ['花蓮', '16:00'], ['新城', '16:18'], ['和平', '16:32'], ['南澳', '16:52'], ['東澳', '16:58'], 
    ['蘇澳新', '17:10']  
  ]
},
'1963': {
  '車種': '區間車',
  '車站時間': [
    ['玉里', '16:19'],
    ['瑞穗', '16:39'], ['光復', '17:05'], ['萬榮', '17:11'], ['鳳林', '17:19'], ['壽豐', '17:37'], ['志學', '17:44'],
    ['吉安', '17:54'], ['花蓮', '18:00'], ['新城', '18:18'], ['和平', '18:32'], ['南澳', '18:52'], ['東澳', '18:58'], 
    ['蘇澳新', '19:10'] 
  ]
},
'1965': {
  '車種': '區間車',
  '車站時間': [
    ['玉里', '17:19'],
    ['瑞穗', '17:39'], ['光復', '18:05'], ['萬榮', '18:11'], ['鳳林', '18:19'], ['壽豐', '18:37'], ['志學', '18:44'],
    ['吉安', '18:54'], ['花蓮', '19:00'], ['新城', '19:18'], ['和平', '19:32'], ['南澳', '19:52'], ['東澳', '19:58'], 
    ['蘇澳新', '20:10'] 
  ]
},
'1967': {
  '車種': '區間車',
  '車站時間': [
    ['玉里', '19:19'],
    ['瑞穗', '19:39'], ['光復', '20:05'], ['萬榮', '20:11'], ['鳳林', '20:19'], ['壽豐', '20:37'], ['志學', '20:44'],
    ['吉安', '20:54'], ['花蓮', '21:05'], ['新城', '21:23'], ['和平', '21:37'], ['南澳', '21:57'], ['東澳', '22:03'], 
    ['蘇澳新', '22:15']  
  ]
},
'1969': {
  '車種': '區間車',
  '車站時間': [
    ['玉里', '20:19'],
    ['瑞穗', '20:39'], ['光復', '21:05'], ['萬榮', '21:11'], ['鳳林', '21:19'], ['壽豐', '21:37'], ['志學', '21:44'],
    ['吉安', '21:54'], ['花蓮', '22:00'], ['新城', '22:18'], ['和平', '22:32'], ['南澳', '22:52'], ['東澳', '22:58'], 
    ['蘇澳新', '23:10']
  ]
},
'1971': {
  '車種': '區間車',
  '車站時間': [
    ['玉里', '21:19'],
    ['瑞穗', '21:39'], ['光復', '22:05'], ['萬榮', '22:11'], ['鳳林', '22:19'], ['壽豐', '22:37'], ['志學', '22:44'],
    ['吉安', '22:54'], ['花蓮', '23:00'], ['新城', '23:18'], ['和平', '23:32'], ['南澳', '23:52'], ['東澳', '23:58'], 
    ['蘇澳新', '00:10']  
  ]
},
'1973': {
  '車種': '區間車',
  '車站時間': [
    ['花蓮', '20:00'],['新城', '20:18'], ['和平', '20:32'], ['南澳', '20:52'], ['東澳', '20:58'],['蘇澳新', '21:10']  
  ]
},
'1975': {
  '車種': '區間車',
  '車站時間': [
    ['花蓮', '06:00'], ['新城', '06:18'], ['和平', '06:32'], ['南澳', '06:52'], ['東澳', '06:58'], ['蘇澳新', '07:10']
  ]
},
'1977': {
  '車種': '區間車',
  '車站時間': [
    ['花蓮', '08:00'],['新城', '08:18'], ['和平', '08:32'], ['南澳', '08:52'], ['東澳', '08:58'],['蘇澳新', '09:10']  
  ]
},
'1979': {
  '車種': '區間車',
  '車站時間': [
    ['花蓮', '10:00'],['新城', '10:18'], ['和平', '10:32'], ['南澳', '10:52'], ['東澳', '10:58'],['蘇澳新', '11:10']  
  ]
},
'1981': {
  '車種': '區間車',
  '車站時間': [
    ['花蓮', '12:00'],['新城', '12:18'], ['和平', '12:32'], ['南澳', '12:52'], ['東澳', '12:58'],['蘇澳新', '13:10']  
  ]
},
'1983': {
  '車種': '區間車',
  '車站時間': [
    ['花蓮', '17:00'],['新城', '17:18'], ['和平', '17:32'], ['南澳', '17:52'], ['東澳', '17:58'],['蘇澳新', '18:10']  
  ]
},
'1501': {
  '車種': '區間車',
  '車站時間': [
      ['蘇澳新', '05:00'],['冬山', '05:05'],['羅東', '05:11'],
      ['宜蘭', '05:23'],['礁溪', '05:31'],['頭城', '05:39'],['福隆', '06:11'],['雙溪', '06:26'],
      ['瑞芳', '06:47'],['八堵', '07:00'],['七堵', '07:05'],['汐止', '07:16'],['汐科', '07:18'],
      ['南港', '07:23'],['松山', '07:28'],['臺北', '07:38'],['萬華', '07:43'],['板橋', '07:49'],['樹林', '07:57']
  ]
},
'1503': {
  '車種': '區間車',
  '車站時間': [
    ['蘇澳新', '06:00'], ['冬山', '06:05'], ['羅東', '06:11'],
    ['宜蘭', '06:23'], ['礁溪', '06:31'], ['頭城', '06:39'], ['福隆', '07:11'], ['雙溪', '07:26'],
    ['瑞芳', '07:47'], ['八堵', '08:00'], ['七堵', '08:05'], ['汐止', '08:16'], ['汐科', '08:18'],
    ['南港', '08:23'], ['松山', '08:28'], ['臺北', '08:38'], ['萬華', '08:43'], ['板橋', '08:49'], ['樹林', '08:57']
  ]
},
'1505': {
  '車種': '區間車',
  '車站時間': [
    ['蘇澳新', '07:00'], ['冬山', '07:05'], ['羅東', '07:11'],
    ['宜蘭', '07:23'], ['礁溪', '07:31'], ['頭城', '07:39'], ['福隆', '08:11'], ['雙溪', '08:26'],
    ['瑞芳', '08:47'], ['八堵', '09:00'], ['七堵', '09:05'], ['汐止', '09:16'], ['汐科', '09:18'],
    ['南港', '09:23'], ['松山', '09:28'], ['臺北', '09:38'], ['萬華', '09:43'], ['板橋', '09:49'], ['樹林', '09:57']
  ]
},
'1507': {
  '車種': '區間車',
  '車站時間': [
    ['蘇澳新', '08:00'], ['冬山', '08:05'], ['羅東', '08:11'],
    ['宜蘭', '08:23'], ['礁溪', '08:31'], ['頭城', '08:39'], ['福隆', '09:11'], ['雙溪', '09:26'],
    ['瑞芳', '09:47'], ['八堵', '10:00'], ['七堵', '10:05'], ['汐止', '10:16'], ['汐科', '10:18'],
    ['南港', '10:23'], ['松山', '10:28'], ['臺北', '10:38'], ['萬華', '10:43'], ['板橋', '10:49'], ['樹林', '10:57']    
  ]
},
'1509': {
  '車種': '區間車',
  '車站時間': [
    ['蘇澳新', '09:00'], ['冬山', '09:05'], ['羅東', '09:11'],
    ['宜蘭', '09:23'], ['礁溪', '09:31'], ['頭城', '09:39'], ['福隆', '10:11'], ['雙溪', '10:26'],
    ['瑞芳', '10:47'], ['八堵', '11:00'], ['七堵', '11:05'], ['汐止', '11:16'], ['汐科', '11:18'],
    ['南港', '11:23'], ['松山', '11:28'], ['臺北', '11:38'], ['萬華', '11:43'], ['板橋', '11:49'], ['樹林', '11:57']    
  ]
},
'1511': {
  '車種': '區間車',
  '車站時間': [
    ['蘇澳新', '10:00'], ['冬山', '10:05'], ['羅東', '10:11'],
    ['宜蘭', '10:23'], ['礁溪', '10:31'], ['頭城', '10:39'], ['福隆', '11:11'], ['雙溪', '11:26'],
    ['瑞芳', '11:47'], ['八堵', '12:00'], ['七堵', '12:05'], ['汐止', '12:16'], ['汐科', '12:18'],
    ['南港', '12:23'], ['松山', '12:28'], ['臺北', '12:38'], ['萬華', '12:43'], ['板橋', '12:49'], ['樹林', '12:57']    
  ]
},
'1513': {
  '車種': '區間車',
  '車站時間': [
    ['蘇澳新', '11:00'], ['冬山', '11:05'], ['羅東', '11:11'],
    ['宜蘭', '11:23'], ['礁溪', '11:31'], ['頭城', '11:39'], ['福隆', '12:11'], ['雙溪', '12:26'],
    ['瑞芳', '12:47'], ['八堵', '13:00'], ['七堵', '13:05'], ['汐止', '13:16'], ['汐科', '13:18'],
    ['南港', '13:23'], ['松山', '13:28'], ['臺北', '13:38'], ['萬華', '13:43'], ['板橋', '13:49'], ['樹林', '13:57']    
  ]
},
'1515': {
  '車種': '區間車',
  '車站時間': [
    ['蘇澳新', '12:00'], ['冬山', '12:05'], ['羅東', '12:11'],
    ['宜蘭', '12:23'], ['礁溪', '12:31'], ['頭城', '12:39'], ['福隆', '13:11'], ['雙溪', '13:26'],
    ['瑞芳', '13:47'], ['八堵', '14:00'], ['七堵', '14:05'], ['汐止', '14:16'], ['汐科', '14:18'],
    ['南港', '14:23'], ['松山', '14:28'], ['臺北', '14:38'], ['萬華', '14:43'], ['板橋', '14:49'], ['樹林', '14:57']    
  ]
},
'1517': {
  '車種': '區間車',
  '車站時間': [
    ['蘇澳新', '13:00'], ['冬山', '13:05'], ['羅東', '13:11'],
    ['宜蘭', '13:23'], ['礁溪', '13:31'], ['頭城', '13:39'], ['福隆', '14:11'], ['雙溪', '14:26'],
    ['瑞芳', '14:47'], ['八堵', '15:00'], ['七堵', '15:05'], ['汐止', '15:16'], ['汐科', '15:18'],
    ['南港', '15:23'], ['松山', '15:28'], ['臺北', '15:38'], ['萬華', '15:43'], ['板橋', '15:49'], ['樹林', '15:57']    
  ]
},
'1519': {
  '車種': '區間車',
  '車站時間': [
    ['蘇澳新', '14:00'], ['冬山', '14:05'], ['羅東', '14:11'],
    ['宜蘭', '14:23'], ['礁溪', '14:31'], ['頭城', '14:39'], ['福隆', '15:11'], ['雙溪', '15:26'],
    ['瑞芳', '15:47'], ['八堵', '16:00'], ['七堵', '16:05'], ['汐止', '16:16'], ['汐科', '16:18'],
    ['南港', '16:23'], ['松山', '16:28'], ['臺北', '16:38'], ['萬華', '16:43'], ['板橋', '16:49'], ['樹林', '16:57']    
  ]
},
'1521': {
  '車種': '區間車',
  '車站時間': [
    ['蘇澳新', '15:00'], ['冬山', '15:05'], ['羅東', '15:11'],
    ['宜蘭', '15:23'], ['礁溪', '15:31'], ['頭城', '15:39'], ['福隆', '16:11'], ['雙溪', '16:26'],
    ['瑞芳', '16:47'], ['八堵', '17:00'], ['七堵', '17:05'], ['汐止', '17:16'], ['汐科', '17:18'],
    ['南港', '17:23'], ['松山', '17:28'], ['臺北', '17:38'], ['萬華', '17:43'], ['板橋', '17:49'], ['樹林', '17:57']    
  ]
},
'1523': {
  '車種': '區間車',
  '車站時間': [
    ['蘇澳新', '16:00'], ['冬山', '16:05'], ['羅東', '16:11'],
    ['宜蘭', '16:23'], ['礁溪', '16:31'], ['頭城', '16:39'], ['福隆', '17:11'], ['雙溪', '17:26'],
    ['瑞芳', '17:47'], ['八堵', '18:00'], ['七堵', '18:05'], ['汐止', '18:16'], ['汐科', '18:18'],
    ['南港', '18:23'], ['松山', '18:28'], ['臺北', '18:38'], ['萬華', '18:43'], ['板橋', '18:49'], ['樹林', '18:57']    
  ]
},
'1525': {
  '車種': '區間車',
  '車站時間': [
    ['蘇澳新', '17:00'], ['冬山', '17:05'], ['羅東', '17:11'],
    ['宜蘭', '17:23'], ['礁溪', '17:31'], ['頭城', '17:39'], ['福隆', '18:11'], ['雙溪', '18:26'],
    ['瑞芳', '18:47'], ['八堵', '19:00'], ['七堵', '19:05'], ['汐止', '19:16'], ['汐科', '19:18'],
    ['南港', '19:23'], ['松山', '19:28'], ['臺北', '19:38'], ['萬華', '19:43'], ['板橋', '19:49'], ['樹林', '19:57']
  ]
},
'1527': {
  '車種': '區間車',
  '車站時間': [
    ['蘇澳新', '18:00'], ['冬山', '18:05'], ['羅東', '18:11'],
    ['宜蘭', '18:23'], ['礁溪', '18:31'], ['頭城', '18:39'], ['福隆', '19:11'], ['雙溪', '19:26'],
    ['瑞芳', '19:47'], ['八堵', '20:00'], ['七堵', '20:05'], ['汐止', '20:16'], ['汐科', '20:18'],
    ['南港', '20:23'], ['松山', '20:28'], ['臺北', '20:38'], ['萬華', '20:43'], ['板橋', '20:49'], ['樹林', '20:57']    
  ]
},
'1529': {
  '車種': '區間車',
  '車站時間': [
    ['蘇澳新', '19:00'], ['冬山', '19:05'], ['羅東', '19:11'],
    ['宜蘭', '19:23'], ['礁溪', '19:31'], ['頭城', '19:39'], ['福隆', '20:11'], ['雙溪', '20:26'],
    ['瑞芳', '20:47'], ['八堵', '21:00'], ['七堵', '21:05'], ['汐止', '21:16'], ['汐科', '21:18'],
    ['南港', '21:23'], ['松山', '21:28'], ['臺北', '21:38'], ['萬華', '21:43'], ['板橋', '21:49'], ['樹林', '21:57']
  ]    
},
'1531': {
  '車種': '區間車',
  '車站時間': [
    ['蘇澳新', '20:00'], ['冬山', '20:05'], ['羅東', '20:11'],
    ['宜蘭', '20:23'], ['礁溪', '20:31'], ['頭城', '20:39'], ['福隆', '21:11'], ['雙溪', '21:26'],
    ['瑞芳', '21:47'], ['八堵', '22:00'], ['七堵', '22:05'], ['汐止', '22:16'], ['汐科', '22:18'],
    ['南港', '22:23'], ['松山', '22:28'], ['臺北', '22:38'], ['萬華', '22:43'], ['板橋', '22:49'], ['樹林', '22:57']    
  ]
},
'1533': {
  '車種': '區間車',
  '車站時間': [
    ['蘇澳新', '21:00'], ['冬山', '21:05'], ['羅東', '21:11'],
    ['宜蘭', '21:23'], ['礁溪', '21:31'], ['頭城', '21:39'], ['福隆', '22:11'], ['雙溪', '22:26'],
    ['瑞芳', '22:47'], ['八堵', '23:00'], ['七堵', '23:05'], ['汐止', '23:16'], ['汐科', '23:18'],
    ['南港', '23:23'], ['松山', '23:28'], ['臺北', '23:38'], ['萬華', '23:43'], ['板橋', '23:49'], ['樹林', '23:57']    
  ]
},
'1535': {
  '車種': '區間車',
  '車站時間': [
    ['蘇澳新', '22:00'], ['冬山', '22:05'], ['羅東', '22:11'],
    ['宜蘭', '22:23'], ['礁溪', '22:31'], ['頭城', '22:39'], ['福隆', '23:11'], ['雙溪', '23:26'],
    ['瑞芳', '23:47'], ['八堵', '00:00'], ['七堵', '00:05']   
  ]
},
'1537': {
  '車種': '區間車',
  '車站時間': [
    ['蘇澳新', '23:00'], ['冬山', '23:05'], ['羅東', '23:11'],['宜蘭', '23:23'], ['礁溪', '23:31'], ['頭城', '23:39'] 
  ]
},

  //復興號5xx

  //加班車5xxx

};

var stations = [
  '臺東', '鹿野', '關山', '池上', '富里', '玉里', '瑞穗', '光復', '萬榮', '鳳林',
    '壽豐', '志學', '吉安', '花蓮', '新城', '和平', '南澳', '東澳', '蘇澳新', '冬山',
    '羅東', '宜蘭', '礁溪', '頭城', '福隆', '雙溪', '瑞芳', '基隆', '八堵', '七堵',
    '汐止', '汐科', '南港', '松山', '臺北', '萬華', '板橋', '樹林', '鶯歌', '桃園',
    '中壢', '楊梅', '湖口', '竹北', '新竹', '竹南', '苗栗', '銅鑼', '三義', '后里',
    '豐原', '潭子', '臺中', '新烏日', '彰化', '員林', '社頭', '田中', '二水', '斗六',
    '斗南', '民雄', '嘉義', '新營', '善化', '永康', '臺南', '岡山', '新左營', '高雄',
    '鳳山', '九曲堂', '屏東', '西勢', '潮州', '南州', '林邊', '枋寮'
];


console.log('trainSchedule:', trainSchedule);
console.log('stations:', stations);

// 動態生成車站下拉選單
// 動態生成車站下拉選單
function generateStationOptions() {
  var startStationSelect = document.getElementById('startStation');
  var endStationSelect = document.getElementById('endStation');
  var stationSelect = document.getElementById('stationSelect');

  for (var i = 0; i < stations.length; i++) {
      var option1 = document.createElement('option');
      option1.value = stations[i];
      option1.text = stations[i];
      startStationSelect.add(option1);

      var option2 = option1.cloneNode(true);
      endStationSelect.add(option2);

      var option3 = option1.cloneNode(true);
      stationSelect.add(option3);
  }
}

// 初始化生成車站下拉選單
generateStationOptions();


// 查詢時刻表的函數（原先的函數）
function filterTrainScheduleByStation() {
  var startStation = document.getElementById('startStation').value;
  var endStation = document.getElementById('endStation').value;

  var scheduleTable = document.getElementById('scheduleTableByStation').getElementsByTagName('tbody')[0];
  scheduleTable.innerHTML = ''; // Clear previous content

  var matchingTrains = [];

  for (var trainNumberKey in trainSchedule) {
      var stationTimes = trainSchedule[trainNumberKey]['車站時間'];
      var startIndex = stationTimes.findIndex(station => station[0] === startStation);
      var endIndex = stationTimes.findIndex(station => station[0] === endStation);

      if (startIndex !== -1 && endIndex !== -1 && startIndex < endIndex) {
          matchingTrains.push({
              trainNumber: trainNumberKey,
              trainType: getTrainTypeWithColor(trainSchedule[trainNumberKey]['車種']),
              startStation: stationTimes[startIndex][0],
              endStation: stationTimes[endIndex][0],
              startTime: stationTimes[startIndex][1],
              endTime: stationTimes[endIndex][1]
          });
      }
  }

  // Sort the matchingTrains array by start time
  matchingTrains.sort(function (a, b) {
      return a.startTime.localeCompare(b.startTime);
  });

  // Populate the schedule table with the sorted data
  for (var i = 0; i < matchingTrains.length; i++) {
      var row = scheduleTable.insertRow();
      var cell1 = row.insertCell(0);
      var cell2 = row.insertCell(1);
      var cell3 = row.insertCell(2);
      var cell4 = row.insertCell(3);
      var cell5 = row.insertCell(4);
      var cell6 = row.insertCell(5);

      cell1.innerHTML = matchingTrains[i].trainNumber;
      cell2.innerHTML = matchingTrains[i].trainType;
      cell3.innerHTML = matchingTrains[i].startStation;
      cell4.innerHTML = matchingTrains[i].endStation;
      cell5.innerHTML = matchingTrains[i].startTime;
      cell6.innerHTML = matchingTrains[i].endTime;

      row.setAttribute('onclick', 'showTrainDetails(\'' + matchingTrains[i].trainNumber + '\')');
  }
}



function filterTrainScheduleByNumber() {
  var trainNumber = document.getElementById('trainNumber').value;

  var scheduleTable = document.getElementById('scheduleTableByNumber').getElementsByTagName('tbody')[0];
  scheduleTable.innerHTML = ''; // Clear previous content

  if (trainSchedule[trainNumber]) {
      var stationTimes = trainSchedule[trainNumber]['車站時間'];

      var row = scheduleTable.insertRow();
      var cell1 = row.insertCell(0);
      var cell2 = row.insertCell(1);

      cell1.innerHTML = trainNumber;
      cell2.innerHTML = trainSchedule[trainNumber]['車種'];

      row.setAttribute('onclick', 'showTrainDetails(\'' + trainNumber + '\')');

      // Show detailed information in the modal
      var modalTitle = document.getElementById('modalTitle');
      var modalTable = document.getElementById('modalTable');
      var modalBody = modalTable.getElementsByTagName('tbody')[0];
      modalBody.innerHTML = ''; // Clear previous content

      modalTitle.innerHTML = '列車詳細資訊 - 車次' + trainNumber  ;

      for (var i = 0; i < stationTimes.length; i++) {
          var rowModal = modalBody.insertRow();
          var cell1Modal = rowModal.insertCell(0);
          var cell2Modal = rowModal.insertCell(1);

          cell1Modal.innerHTML = stationTimes[i][0];
          cell2Modal.innerHTML = stationTimes[i][1];
      }
  }
}

function filterTrainScheduleByStationName() {
  var selectedStation = document.getElementById('stationSelect').value;

  var scheduleTable = document.getElementById('scheduleTableByStationName').getElementsByTagName('tbody')[0];
  scheduleTable.innerHTML = ''; // Clear previous content

  // 將列車數據轉換為數組並根據車站時間排序
  var sortedTrains = Object.keys(trainSchedule).sort(function (a, b) {
    var timeA = getDepartureTimeForStation(a, selectedStation);
    var timeB = getDepartureTimeForStation(b, selectedStation);
    return timeA.localeCompare(timeB);
  });

  // 遍歷排序後的列車數組
  for (var i = 0; i < sortedTrains.length; i++) {
    var trainNumberKey = sortedTrains[i];
    var stationTimes = trainSchedule[trainNumberKey]['車站時間'];

    // 查找所选择车站的索引
    var stationIndex = stationTimes.findIndex(stationInfo => stationInfo[0] === selectedStation);

    // 只显示有停靠所选择车站的列车信息
    if (stationIndex !== -1) {
      var row = scheduleTable.insertRow();
      var cell1 = row.insertCell(0);
      var cell2 = row.insertCell(1);
      var cell3 = row.insertCell(2);

      cell1.innerHTML = trainNumberKey;
      cell2.innerHTML = getTrainTypeWithColor(trainSchedule[trainNumberKey]['車種']);
      cell3.innerHTML = stationTimes[stationIndex][1];

      row.setAttribute('onclick', 'showTrainDetails(\'' + trainNumberKey + '\')');
    }
  }
}

// 使用 getDepartureTimeForStation 函数获取指定列车在指定站点的出发时间
function getDepartureTimeForStation(trainNumber, station) {
  var stationTimes = trainSchedule[trainNumber]['車站時間'];
  var stationIndex = stationTimes.findIndex(stationInfo => stationInfo[0] === station);
  return stationIndex !== -1 ? stationTimes[stationIndex][1] : '';
}








function showTrainDetails(trainNumber) {
  var modalTitle = document.getElementById('modalTitle');
  var modalTable = document.getElementById('modalTable');
  var modalBody = modalTable.getElementsByTagName('tbody')[0];
  modalBody.innerHTML = ''; // Clear previous content

  modalTitle.innerHTML = '列車詳細資訊 - 車次 ' + trainNumber;

  var stationTimes = trainSchedule[trainNumber]['車站時間'];
  for (var i = 0; i < stationTimes.length; i++) {
      var row = modalBody.insertRow();
      var cell1 = row.insertCell(0);
      var cell2 = row.insertCell(1);

      cell1.innerHTML = stationTimes[i][0];
      cell2.innerHTML = stationTimes[i][1];
  }




  document.getElementById('trainDetailsModal').style.display = 'block';
}

function closeTrainDetailsModal() {
  document.getElementById('trainDetailsModal').style.display = 'none';
}

// 新增的 JavaScript 部分
function generateStationFilterOptions() {
  var stationFilterSelect = document.getElementById('stationFilter');

  for (var i = 0; i < stations.length; i++) {
      var option = document.createElement('option');
      option.value = stations[i];
      option.text = stations[i];
      stationFilterSelect.add(option);
  }
}

function filterTrainsByStation() {
  var selectedStation = document.getElementById('stationFilter').value;

  var filteredTrainsTable = document.getElementById('filteredTrainsTable').getElementsByTagName('tbody')[0];
  filteredTrainsTable.innerHTML = ''; // Clear previous content

  for (var trainNumberKey in trainSchedule) {
      var stationTimes = trainSchedule[trainNumberKey]['車站時間'];
      var stationIndex = stationTimes.findIndex(station => station[0] === selectedStation);

      if (stationIndex !== -1) {
          var row = filteredTrainsTable.insertRow();
          var cell1 = row.insertCell(0);
          var cell2 = row.insertCell(1);
          var cell3 = row.insertCell(2);

          cell1.innerHTML = trainNumberKey;
          cell2.innerHTML = getTrainTypeWithColor(trainSchedule[trainNumberKey]['車種']);
          cell3.innerHTML = stationTimes[stationIndex][1];
      }
  }
}

function getTrainTypeWithColor(trainType) {
  var color = '';

  switch (trainType) {
      case '新自強':
          color = 'purple';
          break;
      case '普悠瑪':
          color = '#FF1493'; // Deep Pink
          break;
      case '自強號':
          color = 'red';
          break;
      case '莒光號':
          color = 'orange';
          break;
      case '區間快':
          color = 'green';
          break;
      case '復興號':
          color = 'lightblue';
          break;
      case '區間車':
          color = 'black';
          break;
      case '加班車':
          color = 'brown';
          break;
      default:
          color = 'black';
  }

  return '<span style="color: ' + color + ';">' + trainType + '</span>';
}



// 新增幫助函數
function getArrivalTimeForStation(trainNumber, station) {
  var stationTimes = trainSchedule[trainNumber]['車站時間'];
  var stationIndex = stationTimes.findIndex(s => s[0] === station);
  
  if (stationIndex !== -1) {
      return stationTimes[stationIndex][1];
  }
  return null;
}

